import time 

print("Привет! Меня зовут Мистер Х: ")
time.sleep(1)
print("Давай познакомимся!?")

name=input("Как тебя зовут?")
time.sleep(0.5)
print(f"Очень приятно, {name}!")

age=input("Сколько тебе лет?")
time.sleep(0.5)
Print=(f"Хех, {age}! Мне бы твой возраст :)")

hobby=input("Чем занимаешься в свободное время?")
time.sleep(0.5)
print(f"Супер! Я тоже люблю {hobby.lower()} в меру своих возможностей")

food=input("А какая у тебя любимая еда?")
time.sleep(0.5)
print(f"Ммм... {food}! Звучит вкусно!😋")

time.sleep(1)
print("Было зорово с тобой познакомится!")
time.sleep(0.5)
print("Надеюсь, мы еще поболтаем! :)")